read_verilog  /home/dh/benchmark-sbx/rtl/ime/ime_systolic_array.v
read_verilog  /home/dh/benchmark-sbx/rtl/ime/ime_decision.v
read_verilog  /home/dh/benchmark-sbx/rtl/ime/ime_sad_8x8.v
read_verilog  /home/dh/benchmark-sbx/rtl/ime/ime_sad_16x16_buffer.v
read_verilog  /home/dh/benchmark-sbx/rtl/ime/ime_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/ime/ime_best_mv_below_16.v
read_verilog  /home/dh/benchmark-sbx/rtl/ime/ime_best_mv_above_16.v
read_verilog  /home/dh/benchmark-sbx/rtl/enc_defines.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_pipeline.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_lut_tc.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_normal_filter_1.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_sao_type_dicision.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_controller.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_lut_beta.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_sao_compare_cost.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_normal_filter_2.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_ram_contro.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_sao_add_offset.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_bs.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_mv.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_pu_edge.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_sao_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_sao_cal_diff.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_tu_edge.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_strong_filter.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_sao_cal_offset.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_clip3_str.v
read_verilog  /home/dh/benchmark-sbx/rtl/db/db_qp.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/db_lcu_ram.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/cabac_mvd_left_2p_18x4.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/db_qp_ram.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/db_left_ram.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/cabac_neighbour_1p_8xMB_X_TOTAL.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/buf_ram_2p_64x512.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/db_mv_ram.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/cabac_mvd_top_2p_18xMB_X_TOTAL.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/db_top_ram.v
#read_verilog  /home/dh/benchmark-sbx/rtl/mem/coeff_32x512.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/buf_ram_1p_64x192.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/cabac_mn_1p_16x64.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/cabac_ctx_state_2p_7x64.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/db_ram_1p.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/buf_ram_2p_64x208.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/cabac_neighbour_2p_12x128.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/buf_ram_1p_6x85.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/rtl_model/cur_mb_yuv.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/rtl_model/rom_1p.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/rtl_model/ram_2p.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/rtl_model/ram_dp_be.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/rtl_model/rf_1p.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/rtl_model/ram_1p.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/rtl_model/rf_2p_be.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/rtl_model/ram_dp.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/rtl_model/rf_2p.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/buf_ram_dp_128x512.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/buf_ram_2p_64x32.v
read_verilog  /home/dh/benchmark-sbx/rtl/mem/dct_transpose_32x16.v
read_verilog  /home/dh/benchmark-sbx/rtl/fme/fme_ip_quarter_ver.v
read_verilog  /home/dh/benchmark-sbx/rtl/fme/fme_ip_half_ver.v
read_verilog  /home/dh/benchmark-sbx/rtl/fme/fme_interpolator_8pel.v
read_verilog  /home/dh/benchmark-sbx/rtl/fme/fme_ctrl.v
read_verilog  /home/dh/benchmark-sbx/rtl/fme/fme_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/fme/fme_pred.v
read_verilog  /home/dh/benchmark-sbx/rtl/fme/fme_interpolator.v
read_verilog  /home/dh/benchmark-sbx/rtl/fme/fme_cost.v
read_verilog  /home/dh/benchmark-sbx/rtl/fme/fme_satd_gen.v
read_verilog  /home/dh/benchmark-sbx/rtl/fme/fme_interpolator_8x8.v
read_verilog  /home/dh/benchmark-sbx/rtl/fme/fme_satd_8x8.v
read_verilog  /home/dh/benchmark-sbx/rtl/pre_i/fetch8x8.v
read_verilog  /home/dh/benchmark-sbx/rtl/pre_i/md_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/pre_i/control.v
read_verilog  /home/dh/benchmark-sbx/rtl/pre_i/md_fetch.v
read_verilog  /home/dh/benchmark-sbx/rtl/pre_i/compare.v
read_verilog  /home/dh/benchmark-sbx/rtl/pre_i/counter.v
read_verilog  /home/dh/benchmark-sbx/rtl/pre_i/mode_write.v
read_verilog  /home/dh/benchmark-sbx/rtl/pre_i/DC_Plannar.v
read_verilog  /home/dh/benchmark-sbx/rtl/pre_i/gxgy.v
read_verilog  /home/dh/benchmark-sbx/rtl/pre_i/hevc_md_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/pre_i/md_ram.v
read_verilog  /home/dh/benchmark-sbx/rtl/mc/mvd_getBits.v
read_verilog  /home/dh/benchmark-sbx/rtl/mc/mc_chroma_filter.v
read_verilog  /home/dh/benchmark-sbx/rtl/mc/mc_ctrl.v
read_verilog  /home/dh/benchmark-sbx/rtl/mc/mc_chroma_ip4x4.v
read_verilog  /home/dh/benchmark-sbx/rtl/mc/mc_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/mc/mvd_can_mv_addr.v
read_verilog  /home/dh/benchmark-sbx/rtl/mc/mc_chroma_ip_1p.v
read_verilog  /home/dh/benchmark-sbx/rtl/mc/mc_chroma_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/mc/mvd_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/mc/mc_tq.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/rdcost_decision.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/coe_tlb.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/cur_mb.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/mem_pipo_dp.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/top.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/mem_lipo_1p_bw.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/mem_buf.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/rec_tlb.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/md.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/mem_pipo_2p.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/mem_bipo_2p.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/top_ctrl.v
read_verilog  /home/dh/benchmark-sbx/rtl/top/mem_lipo_1p.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_binari_get_sig_ctx.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_slice_init.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_binari_sao_offset.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_binari_epxgolomb_1kth.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_bae.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_binari_nxn_coeff.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_bae_stage3.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_binari_coeff_last_sig_xy.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_piso_1.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_residual.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_bae_stage2.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_cu_binari_tree.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_binari_cre.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_bae_stage1.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/range_lps_table.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_binari_4x4_coeff.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_modeling.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_binari_qp.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_cu_binari_intra_luma_mode.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_cu_binari_mv.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_binari_cu.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_pu_binari_mv.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_cu_binari_intra.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_mvd.v
read_verilog  /home/dh/benchmark-sbx/rtl/cabac/cabac_binarization.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/stage3.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly1_8.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/mcm00.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat_16.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly_16.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/mod.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat1_4.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/stage1.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly3_8.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat3.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/dct_top_2d.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/dst.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat_8.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly_4.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly3.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/transform_memory.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/q_iq.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/spiral_0.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/mcm_16.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/mcm_4.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly_32.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/spiral_8.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/mux_32.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat1_8.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/dct_ctrl.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/quan.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat3_4.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/coeff_32x512.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly1_32.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/addr.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat1_16.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat1_32.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat3_32.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly_8.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/dct_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly3_16.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/spiral_16.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/mcm_8.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/mcm.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly3_4.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat_4.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/offset_shift.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat3_8.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat1.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/tq_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat_32.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/premuat3_16.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly1_4.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly1.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/spiral_4.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/mcm_0.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly3_32.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/butterfly1_16.v
read_verilog  /home/dh/benchmark-sbx/rtl/tq/ctrl_transmemory.v
read_verilog  /home/dh/benchmark-sbx/rtl/intra/ram_lcu_row_32x64.v
read_verilog  /home/dh/benchmark-sbx/rtl/intra/intra_ref.v
read_verilog  /home/dh/benchmark-sbx/rtl/intra/intra_top.v
read_verilog  /home/dh/benchmark-sbx/rtl/intra/intra_ctrl.v
read_verilog  /home/dh/benchmark-sbx/rtl/intra/ram_lcu_column_32x64.v
read_verilog  /home/dh/benchmark-sbx/rtl/intra/intra_pred.v
read_verilog  /home/dh/benchmark-sbx/rtl/intra/ram_frame_row_32x480.v
read_verilog  /home/dh/benchmark-sbx/rtl/fetch/fetch_cur_chroma.v
read_verilog  /home/dh/benchmark-sbx/rtl/fetch/fetch_cur_luma.v
read_verilog  /home/dh/benchmark-sbx/rtl/fetch/wrap_ref_chroma.v
read_verilog  /home/dh/benchmark-sbx/rtl/fetch/fetch.v
read_verilog  /home/dh/benchmark-sbx/rtl/fetch/fetch_db.v
read_verilog  /home/dh/benchmark-sbx/rtl/fetch/fetch_ref_chroma.v
read_verilog  /home/dh/benchmark-sbx/rtl/fetch/fetch_ref_luma.v
read_verilog  /home/dh/benchmark-sbx/rtl/fetch/mem_bilo_db.v
read_verilog  /home/dh/benchmark-sbx/rtl/fetch/wrap_ref_luma.v
read_verilog  /home/dh/benchmark-sbx/rtl/fetch/fetch_ctrl.v
read_verilog  /home/dh/benchmark-sbx/rtl/h265core.v

synth_xilinx -abc9 -top h265core -nocarry
write_verilog -noexpr core.v
